{"data":{"site":{"siteMetadata":{"author":"Song Wang","homeCity":"Beijing"}},"markdownRemark":{"html":"<p>Recently, as the so-called <a href=\"https://www.battleforthenet.com/july12/\">Internet of action day</a> comes, lots of tech companies are promoting the saving Internet Neutrality action. I couldn’t help pay some attention to the related links, like Blake(CEO of Godaddy)‘s blog <a href=\"https://blakesblog.com/2017/07/netneutrality/\">The Free and Open Net Is Under Attack, Again</a>, the <a href=\"https://www.battleforthenet.com/july12/\">Internet Association website</a>, etc. I have to say I love their articles. And I love the Internet the same as they do. I want the Internet Neutrality stays the same way. </p>\n<p>I want the Internet Neutrality remains the way it is, cause I’ve seen the opposite case in China.</p>\n<p>To me, the best part of Internet is the freedom, and I can never get it without equal openness. </p>\n<p>I want the Internet Neutrality remains the way it is, cause I’ve seen the opposite case in China. I’ve seen the Internet with throttlings and bans. I’ve seen Google, Facebook, or Instagram banned in favor of the tech companies which were not as good as in the same level.  I have witnessed the real tech giants like Google killed by the ‘selected’ companies by inequity and left with a much less access to the rest of the world. I wish I won’t see this again in America. </p>","excerpt":"Recently, as the so-called  Internet of action day  comes, lots of tech companies are promoting the saving Internet Neutrality action. I…","fields":{"slug":"/blog/2017-07-13-please-save-the-internet-neutrality/","tagSlugs":["/tags/internet/"]},"frontmatter":{"title":"Please save the Internet neutrality","tags":["Internet"],"description":null,"date":"July 13, 2017"}}},"pageContext":{"slug":"/blog/2017-07-13-please-save-the-internet-neutrality/","previous":{"fields":{"slug":"/blog/2017-07-12-starting-to-write/"},"frontmatter":{"title":"Starting to write","tags":["writing"]}},"next":{"fields":{"slug":"/blog/2017-07-13-the-best-way-to-learn-coding-to-me/"},"frontmatter":{"title":"The best way to learn coding to me","tags":["coding"]}}}}