{"data":{"site":{"siteMetadata":{"author":"Song Wang","homeCity":"Beijing"}},"markdownRemark":{"html":"<p>Dynamic programming might be the most interesting approach in computer science with a clean and elegant solution. The general idea is to find the mathematical relations(equations) between the input and output. With enough “dark magic”, the solution could be extremely simple.</p>\n<p>The following question is asked by an interviewer who’s specialized in algorithms.</p>\n<blockquote>\n<p>A kid can move towards three directions: up, left, right. Each move has the same length. The kid can’t move down and can’t move to his last position(eg. moving to the right then left is not allowed). How many unique ways by n moves the kid could have?</p>\n</blockquote>\n<h2>The intuitive backtracking way, O(n!)</h2>\n<p>By the first glance, the question could be done by backtracking all the possible ways starting from position “0,0”, and count the number of it. </p>\n<p>But at the same time, since backtracking needs to be done incrementally, in the worst case we have to store all the previous moves in the memory, which is highly inefficient. Also, the computing complexity of backtracking goes up to n factorial, with a pretty large memory space.</p>\n<p>That being said, the dumb solution is obviously a less optimized solution. But we can certainly try some more consistent way by finding the pattern or pure math.</p>\n<h2>Dynamic programming, O(n)</h2>\n<p>By being less dumb, we may notice that we don’t really have to store all of the previews moves. Since we are just calculating number count, we could find a relation with previous ending spot and the next one, and just store the counting number without move records. The validating part could be avoid by not adding invalid counts from each step followed by a same pattern. </p>\n<h4>Finding the DP relation equation</h4>\n<p>That being said, if we have a pattern function that links the counting numbers’ relations with each other, then we could find a much smarter way to incrementally get the result. But the relation is not that obvious in this problem, and that’s where I got stuck. Normally, a dynamic programming only need the relation between the previous and current position, but in this problem, the relation actually lies from the first position to the last position. </p>\n<h4>TL;DR</h4>\n<p>Considering this question, for n moves, the kid could move at most up 10 times. But he doesn’t have to be up 10 times, he could end up in 0 - 9 up times. So we may consider the kid have 10 cases divided by upper level. For upper 0 level, we say the kids didn’t move up at all, for upper 1 level we say the kid moved up once. </p>\n<p>If you think about the relation by upper level, for each level the id went up, he could end up with lots of unique ways, but that’s all related with the ways from the last level. </p>\n<p>On level n, for the position with x-axis of 0, the kid could have only one way coming right from the last level with x-axis of 0, for the position with x-axis of +1 or -1, the kid has two times of the ways coming from the level before the last level, and it keeps following the same pattern throughout the levels.</p>\n<p>So, the final pattern is </p>\n<blockquote>\n<p>F(n) = F(n-1) + 2F(n-2) + 2F(n-3) + … + 2F(1) + 2</p>\n</blockquote>\n<p>with F(n) for the total ways with n steps. </p>\n<p>By that equation, we could simply organize a simple array and keep track from move 0 to move n, and calculate the final result based on all the former results. The complexity from that would be linear, which is way better than n factorial.</p>\n<h2>Mathematical Induction, O(1)</h2>\n<p>A Linear way is usually considered as a “good” solution for computing time. But if we could find the pure mathematical equation that takes n and simply puts the final result, that would be the fastest possible solution. </p>\n<h3>Draw and find the Pascal’s triangle</h3>\n<p>If we are trying to find the pure math relations, we usually need to draw out the math and “feel” it.</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/pascal-274ab065873e91c546a2592f2f34272b-41ba9.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 97.02868852459017%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAATCAYAAACQjC21AAAACXBIWXMAAAsTAAALEwEAmpwYAAAB3UlEQVQ4y41UCXKDMAzk/6/skaYEwmnAxhyqViAXAmnjGQE29kq7khURj3meScfgh/Ct69ZaapuWTF1TXdXUmIaGYaDHsxiRLszTzDbRPb1T3/fLxvl4YDvC2c07AI7jSEWWU3pL2RJyHJVuemZnoBEeiChNUomuyHPK0oyulyvZzu6i2RudgkfQI4lv9PV5ofga08fbu4DH3zGvJ6xdQxNL8WqUkXOOfO+FYtd2Qr13vYiORGANgHvxnusY6Q8cXoCdUNeoMPfeiwPP0mAP1quypPyePWR6TYoeHIeRy8aHqGCI3K9ZB7Cuj+wATh4lkAixoakNbxgFrMiKcBhz6Iy5FVlaMYChZiHZadnoQmtaya7tOpkjaoD9VY8HDTFB6SAhiCrnetSbgPmi4SiOsE91lQTyXJMWKOMDtJDdqijJ8PUyIsEgh0ANANij11Arwa+B7ChruNCjZEDQbbj+APDqCEnZarMNHV63zl4dgTIoaiKqspLotBZBDVrBQBlM8F6SZ+U/dIUFyqpDXVVy5VB/cLK0NC9g0BFgB0C/lBCAdxpiAZ1Ge2JjDIvvTsvjX8rSddwvpY7pt2sR6wCLPMvk2qFpgOLhpiyNdC8+vqdVguBwbVd69QTgpAv9ACAM13dokE3FAAAAAElFTkSuQmCC'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"pascal's triangle\"\n        title=\"\"\n        src=\"/static/pascal-274ab065873e91c546a2592f2f34272b-fb8a0.png\"\n        srcset=\"/static/pascal-274ab065873e91c546a2592f2f34272b-1a291.png 148w,\n/static/pascal-274ab065873e91c546a2592f2f34272b-2bc4a.png 295w,\n/static/pascal-274ab065873e91c546a2592f2f34272b-fb8a0.png 590w,\n/static/pascal-274ab065873e91c546a2592f2f34272b-526de.png 885w,\n/static/pascal-274ab065873e91c546a2592f2f34272b-41ba9.png 976w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>In the triangle, the solid line stands for the first move, the dashed stands for the second, and the curled for the third. By connecting all of the ending positions from each move, we could find a larger triangle every time. And if you looked at the ending counting numbers from the left edge or right edge of the triangle, it actually goes like a <a href=\"https://www.wikiwand.com/en/Pascal%27s_triangle\">Pascal’s triangle</a>, from “1” to “1, 2 ,1”, to “1, 3, 3, 1” to “1, 4, 6, 4, 1”.</p>\n<p>Following through the two Pascal’s triangles, we could find the ultimate equation is</p>\n<blockquote>\n<p>F(n) = 2 ^ (n + 1) - 1</p>\n</blockquote>\n<p>And by that, the computing time will always by the same time, which is constant time, the fastest way.</p>","excerpt":"Dynamic programming might be the most interesting approach in computer science with a clean and elegant solution. The general idea is to…","fields":{"slug":"/blog/2018-01-10-using-pascals-triangle-with-dynamic-programing-problem/","tagSlugs":["/tags/algorithm/","/tags/dynamic-programming/"]},"frontmatter":{"title":"Using Pascal's triangle for dynamic programming problem","tags":["algorithm","dynamic programming"],"description":null,"date":"January 10, 2018"}}},"pageContext":{"slug":"/blog/2018-01-10-using-pascals-triangle-with-dynamic-programing-problem/","previous":{"fields":{"slug":"/blog/2018-01-09-javascript-throttling-and-debouncing/"},"frontmatter":{"title":"Javascript throttling and debouncing","tags":["javascript","throttling","debouncing","event"]}},"next":{"fields":{"slug":"/blog/2018-03-30-asynchronous-throttling-in-javascript/"},"frontmatter":{"title":"asynchronous throttling in Javascript","tags":["javascript","asynchronous","throttle"]}}}}